railed/app/controllers/bathrooms_controller.rb

	def index
    @bathrooms = Bathroom.all
---
SELECT "bathrooms".* FROM "bathrooms"

  def show
    @bathroom = Bathroom.find(params[:id])
---
SELECT  "bathrooms".* FROM "bathrooms"  WHERE "bathrooms"."id" = ? LIMIT 1  [["id", 1]]