railed/app/views/bathrooms/show.html.erb

<h3> Reviews (<%= @bathroom.review_count if @bathroom.review_count %>) </h3>
<% list = Review.where(bathroom:@bathroom.id) %>
<% for @review in list do %>
	<% @user = User.find(@review.user_id) %>
---
SELECT "reviews".* FROM "reviews"  WHERE "reviews"."bathroom_id" = 1
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]