railed/app/views/users/show.html.erb

SELECT "reviews".* FROM "reviews"  WHERE "reviews"."user_id" = 1
SELECT  "bathrooms".* FROM "bathrooms"  WHERE "bathrooms"."id" = ? LIMIT 1  [["id", 1]]
---
<h3> Reviews(<%= @user.review_count if @user.review_count %>): </h3>
<% list = Review.where(user:@user.id) %>
<% for @review in list do %>
<% @bathroom = Bathroom.find(@review.bathroom_id) %>