railed/app/views/home/index.html.erb

SELECT COUNT(*) FROM "users"
---
			<p>
				<%= link_to 'Users:', users_path %> <%= User.count %> registered